nozzlesimulations/R3_Re2.01M_Pr1.84_M1/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
54800
(
(22.8842 -0.000839199 0)
(22.889 -0.000124189 0)
(22.8896 -4.77252e-06 -7.39603e-26)
(22.8895 1.81233e-05 -7.396e-26)
(22.8893 2.63234e-05 0)
(22.8891 3.20994e-05 1.47917e-25)
(22.8888 3.75381e-05 1.47915e-25)
(22.8885 4.26077e-05 0)
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (22.88 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    wall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    heatedWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
