nozzlesimulations/R3_Re2.01M_Pr1.84_M1/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 5.73e4;

boundaryField
{
	inlet
	{
		type	fixedValue; 
		value	uniform 5.73e2;
	}

	outlet
	{
		type	zeroGradient;
	}

	wall
	{
	type            epsilonWallFunction;
        value           uniform 5.73e2; 
	}

	heatedWall
	{
	        type            epsilonWallFunction;
        value           uniform 5.73e2; 
	}

	frontAndBack
	{
		type	empty;	
	}
}


// ************************************************************************* //
