nozzlesimulations/R3_Re2.01M_Pr1.84_M1/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 7.25e-6;

boundaryField
{
	inlet
	{
		type	fixedValue;	
		value	uniform 7.25e-6;
	}

	outlet
	{
		type	zeroGradient;
	}

	wall
	{
        type            nutkWallFunction;
        value           uniform 7.25e-6; 
	}

	heatedWall
	{
        type            nutkWallFunction;
        value           uniform 7.25e-6; 
	}


	frontAndBack
	{
		type	empty;	
	}
}


// ************************************************************************* //
