nozzlesimulations/R3_Re2.01M_Pr1.84_M1/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "0";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
108570
(
0.000281267
-1.0912e-07
-1.7793e-11
0.000281288
-2.08887e-08
-9.63307e-12
0.000281294
-6.49814e-09
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
40
(
-0.000281158
-0.000240146
-0.000205116
-0.000175196
-0.00014964
-0.000127813
-0.000109169
-9.32445e-05
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
40
(
0.000281088
0.000240071
0.000205031
0.000175101
0.00014954
0.000127709
0.000109067
9.31471e-05
...
)
;
    }
    wall
    {
        type            calculated;
        value           uniform 0;
    }
    heatedWall
    {
        type            calculated;
        value           uniform 0;
    }
    frontAndBack
    {
        type            empty;
        value           nonuniform 0();
    }
}


// ************************************************************************* //
