nozzlesimulations/R3_Re2.01M_Pr1.84_M1/0/y
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      y;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
54800
(
0.0029331
0.0029331
0.0029331
0.0029331
0.00293311
0.00293312
0.00293313
0.00293315
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
40
(
0.00317184
0.00276237
0.0024236
0.00214607
0.00192146
0.00174222
0.00160146
0.00149282
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
40
(
0.00317184
0.00276237
0.0024236
0.00214607
0.00192146
0.00174222
0.00160146
0.00149282
...
)
;
    }
    wall
    {
        type            calculated;
        value           uniform 1e-15;
    }
    heatedWall
    {
        type            calculated;
        value           uniform 1e-15;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
