nozzlesimulations/R3_Re2.01M_Pr1.84_M1/0/yPlus
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      yPlus;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    wall
    {
        type            calculated;
        value           nonuniform List<scalar> 
1300
(
313.872
313.858
313.844
313.831
313.818
313.806
313.794
313.782
...
)
;
    }
    heatedWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
680
(
370.514
370.513
370.504
370.49
370.474
370.457
370.44
370.424
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
