nozzlesimulations/R3_Re2.01M_Pr1.84_M1/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          40;
        startFace       108570;
    }
    outlet
    {
        type            patch;
        nFaces          40;
        startFace       108610;
    }
    wall
    {
        type            wall;
        nFaces          1300;
        startFace       108650;
    }
    heatedWall
    {
        type            wall;
        nFaces          680;
        startFace       109950;
    }
    frontAndBack
    {
        type            empty;
        nFaces          109600;
        startFace       110630;
    }
)

// ************************************************************************* //
