nozzlesimulations/R3_Re2.01M_Pr1.84_M1/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;

nu              nu [ 0 2 -1 0 0 0 0 ] 7.25e-8;

// Thermal expansion coefficient
beta            beta [0 0 0 -1 0 0 0] 0.0143; 

// Reference temperature
TRef            TRef [0 0 0 1 0 0 0] 293.15;

// Laminar Prandtl number
Pr              Pr [0 0 0 0 0 0 0] 1.84;

// Turbulent Prandtl number
Prt             Prt [0 0 0 0 0 0 0] 0.8;




// ************************************************************************* //
