nozzlesimulations/R3_Re2.01M_Pr1.84_M1/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-7;
        relTol          0;
	smoother	GaussSeidel;
	nPreSweeps	0;
	nPostSweeps	2;	
	cacheAgglomeration	on;
	agglomerator	faceAreaPair;
	nCellsInCoarsestLevel 	100;
	mergeLevels	1;
    }


    U
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0;
    }

    k
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0;
    }

    epsilon
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0;
    }
	
    nut
    {
	solver	PBiCG; 
	preconditioner	DILU; 
	tolerance	1e-8; 
	relTol		0; 
    }

    T
    {
	solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0;
    }
    p_rgh
    {
        solver          GAMG;
        tolerance       1e-7;
        relTol          0;
	smoother	GaussSeidel;
	nPreSweeps	0;
	nPostSweeps	2;	
	cacheAgglomeration	on;
	agglomerator	faceAreaPair;
	nCellsInCoarsestLevel 	100;
	mergeLevels	1;
    }

}

potentialFlow
{
    nNonOrthogonalCorrectors 0;
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;

}

relaxationFactors
{
    fields
    {
        p               0.3;
	p_rgh		0.3;
    }
    equations
    {

        U               0.7;
        k               0.7;
        epsilon		0.7;	
    }
}


// ************************************************************************* //
